package cn.littleBird;

public class Duizhang {
  public static void main(String[] args) {
/** 工资日
 *  2022 03       40488
 *  2022 04       45627
 *  2022 05
 *  2022 06
 *  2022 07
 *  2022 08
 *  2022 09
 *  2022 10
 *  2022 11
 *  2022 12
 */
    System.out.println("马老板欠我的");
    int mahuifeng = 800 + 660 + 530 + 944 + 2000 + 541 + 1320 + 613 + 330 + 1100 + 1000 + 1000 + 3000 - 700 + 660 + 660 + 673 + 7500 - 66 + 330 + 990 + 200 + 330 + 330 + 330 + 330 + 660 - 7500 + 660 + 2244 + 330 + 330 + 990 + 660 +
        660 + 660 + 660 + 328 + 330 + 990 + 1650 + 660 + 300 + 7500 + 1188 + 1063 + 660 + 660 + 660 + 1320 + 990 + 5000 + 5000 + 5000 + 5000 + 7000 - 1000 - 7600 + 990 + 990 + 330 + 330 + 330 + 330 - 9000
        - 15000 + 2508 + 4000 + 6000 + 3000 + 3000 + 3000 + 330 + 6000 + 3000 + 990 + 3000 + 3500 - 24000 + 6000 + 4000 + 6000 - 1300 - 8700 - 10000 + 4000 + 9000 + 4074 - 8000 + 41 + 40 + 38 + 20 + 36 + 39 + 43 + 2 + 38 + 52 + 8
        + 20750 + 18033 + 38 + 7500 + 78 + 1000 + 167 - 15000 + 450 + 318 - 2500 + 716 + 193 - 13000 + 47 + 7 + 267 + 229 + 121 + 364 + 325 + 343 + 350 + 65 + 91;
    System.out.println(
        mahuifeng


    );

    //花呗 借呗 信用卡 年终奖 余额,建雄欠我的钱
    //int hb = 26664, jb = 27189, xyk = 26838, sjx;
//      2022-03-10
//      int hb = 26342, jb = 30118, xyk = 0, nzj = 12405, ye = 1603 + 630, sjx = 1500;

//      2022-04-25 合并年终奖为余额
    int hb = 25966, jb = 5445, xyk = 7000, nzj = 0, ye = 643, sjx = 0;

    System.out.println("实际为：  ");
    System.out.println(mahuifeng - hb - jb - xyk + sjx + ye + nzj);
  }

  String fc_games = "" +
      "怪鸭历险记" +
      "忍者龙剑传" +
      "赤影战士" +
      "魂斗罗6、超级魂斗罗" +
      "sd快打" +
      "洛克人" +
      "兔宝宝历险记" +
      "智慧桥摩艾君" +
      "荒野大镖客2" +
      "沙丘魔堡" +
      "火枪英雄" +
      "热血格斗" +
      "热血篮球" +
      "热血足球" +
      "洋枪快杰" +
      "松鼠大作战" +
      "忍者神龟" +
      "三目童子" +
      "幽游白书" +
      "泡泡龙" +
      "忍者猫" +
      "摔角" +
      "西游记2" +
      "赤色要塞" +
      "成龙之龙" +
      "冒险岛" +
      "双截龙" +
      "烈火" +
      "雪人兄弟" +
      "古巴战争" +
      "沙罗曼蛇" +
      "忍者蛙" +
      "彩虹岛" +
      "蝙蝠侠";

  //
}